---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NoRotateMirrorZ
source: html/42d1bf27-f6a7-7a26-e537-dbf4e0bc2570.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NoRotateMirrorZ Property

Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRotateMirrorZ { get; }
```